package to.msn.wings.selflearn.chap08.capsule;

public class Capsule {

	public static void main(String[] args) {
		

	}

}

/*
オブジェクト指向プログラミングを学ぶうえで「カプセル化」、「継承」、「ポリモーフィズム」といったキーワードは欠かせない。
「カプセル化（Encapsulation）」の基本は使い手に関係ないものは見せないである。
クラスで用意された機能のうち、利用するうえで知らなくても差し支えないものを隠してしまうと言い換えてもよい。

クラスの中で特定のメンバーを見せるかどうかを管理しているのは「アクセス修飾子」である。
○アクセス修飾子
|アクセス修飾子|概要|
|public        |すべてのクラスからアクセス可能|
|protected     |現在のクラスと派生クラス、同じパッケージのクラスからアクセス可能|
|なし          |現在のクラスと同じパッケージのクラスからアクセス可能|
|private       |現在のクラスからのみアクセス可能|
*/
